require "rails_helper"

describe TripsController, type: :controller do

  render_views

  before(:all) do
    
    DatabaseSeeder.new('fixtures/small.json')
  end

  describe 'index' do

    it 'display correct data' do
      get :index, params: {from: 'Самара', to: 'Москва'}
      page = "<!DOCTYPE html>\n<html>\n  <head>\n    <title>Task4</title>\n    \n    \n\n    <link rel=\"stylesheet\" media=\"all\" href=\"/assets/application-b324c44f04a0d0da658824105489a2676d49df561c3d06723770321fd441977c.css\" />\n    <script src=\"/assets/application-85d9a73fda0f0681d4ef3a9b1147090e2e807aa98db37994df53a3e31b5538c9.js\"></script>\n  </head>\n\n  <body>\n    <h1>\n  Автобусы Самара – Москва\n</h1>\n<h2>\n  В расписании 13 рейсов\n</h2>\n\n  <ul>\n    <li>Отправление: 12:18</li>\n<li>Прибытие: 20:47</li>\n<li>В пути: 8ч. 29мин.</li>\n<li>Цена: 563р. 16коп.</li>\n<li>Автобус: Сканиа №961</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 13:19</li>\n<li>Прибытие: 16:47</li>\n<li>В пути: 3ч. 28мин.</li>\n<li>Цена: 761р. 48коп.</li>\n<li>Автобус: УАЗ №488</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 13:22</li>\n<li>Прибытие: 17:13</li>\n<li>В пути: 3ч. 51мин.</li>\n<li>Цена: 249р. 18коп.</li>\n<li>Автобус: Вольво №793</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 13:31</li>\n<li>Прибытие: 20:10</li>\n<li>В пути: 6ч. 39мин.</li>\n<li>Цена: 157р. 85коп.</li>\n<li>Автобус: Буханка №404</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 15:19</li>\n<li>Прибытие: 20:44</li>\n<li>В пути: 5ч. 25мин.</li>\n<li>Цена: 149р. 83коп.</li>\n<li>Автобус: УАЗ №508</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 15:46</li>\n<li>Прибытие: 22:53</li>\n<li>В пути: 7ч. 7мин.</li>\n<li>Цена: 347р. 62коп.</li>\n<li>Автобус: Вольво №370</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 15:49</li>\n<li>Прибытие: 19:40</li>\n<li>В пути: 3ч. 51мин.</li>\n<li>Цена: 686р. 32коп.</li>\n<li>Автобус: Вольво №963</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 17:19</li>\n<li>Прибытие: 17:34</li>\n<li>В пути: 0ч. 15мин.</li>\n<li>Цена: 833р. 59коп.</li>\n<li>Автобус: Вольво №443</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 17:26</li>\n<li>Прибытие: 17:54</li>\n<li>В пути: 0ч. 28мин.</li>\n<li>Цена: 131р. 32коп.</li>\n<li>Автобус: Газель №568</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 17:37</li>\n<li>Прибытие: 02:30</li>\n<li>В пути: 8ч. 53мин.</li>\n<li>Цена: 378р. 88коп.</li>\n<li>Автобус: Икарус №67</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 19:35</li>\n<li>Прибытие: 23:58</li>\n<li>В пути: 4ч. 23мин.</li>\n<li>Цена: 169р. 95коп.</li>\n<li>Автобус: Мерседес №640</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 19:42</li>\n<li>Прибытие: 00:59</li>\n<li>В пути: 5ч. 17мин.</li>\n<li>Цена: 363р. 37коп.</li>\n<li>Автобус: ГАЗ №911</li>\n\n  </ul>\n  ====================================================\n\n  <ul>\n    <li>Отправление: 22:41</li>\n<li>Прибытие: 04:56</li>\n<li>В пути: 6ч. 15мин.</li>\n<li>Цена: 818р. 38коп.</li>\n<li>Автобус: Вольво №652</li>\n\n  </ul>\n  ====================================================\n\n\n  </body>\n</html>\n"
      expect(response.body).to eq page
    end
  end

end